package main

import (
	"log"
	"os"
)

// ***********************************************************************************
// Хз для чего это нужно - без этого не работал анализатор. Но принцип так и не понял.
// ***********************************************************************************
func main() {
	log.Fatal("Всё ок") // NO error expected here
	os.Exit(0)          // NO error expected here

	// panic всегда должен быть обнаружен
	panic("ошибка") // want "use of builtin panic is discouraged"
}
